perf/tests/intensive/load_testing/load_testing_2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Ramp
      duration: 30
      arrivalRate: 0
      rampTo: 2
    - name: Plain
      duration: 20
      arrivalRate: 2
    - name: Ramp
      duration: 30
      arrivalRate: 2
      rampTo: 5
    - name: Plain
      duration: 20
      arrivalRate: 5
    - name: Ramp
      duration: 30
      arrivalRate: 5
      rampTo: 8
    - name: Plain
      duration: 20
      arrivalRate: 8
    - name: Plain
      duration: 20
      arrivalRate: 0

scenarios:
  - name: load testing 1 (/)
    flow:
      - get:
          url: '/intensive'